# SlabShapeEdit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..SlabShapeEdit Property
GroupTypeId Class See Also
---
Slab Shape Edit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId SlabShapeEdit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlabShapeEdit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlabShapeEdit {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace